// lib/context.ts

export const title = '자기찾기연구소';

export const intro = `안녕하세요 자기찾기 연구소 출판사입니다 !
이 세상 80억 인구가운데 가장 소중한 사람이 있다면 그것은 누구일까요?
어린 아이 순간부터 죽을 때까지 일평생 함께하는 사람,
그 사람은 바로 '나'입니다.

당신은 당신에 대해 얼마나 사랑하고 있나요?
그 사랑의 출발은 나 자신을 아는 것 부터 입니다.
그 관심을 자신에게 보여주세요.`;

export const brandColors = {
    primary: '#4B3F72', // 고전적이고 신뢰감 있는 진한 보라빛 남색
    secondary: '#Fcded6', // 따뜻하고 부드러운 크림색 (책 종이 느낌)
    textDark: '#2D2A26', // 차분하면서도 읽기 좋은 짙은 갈색
    textSoft: '#7D7463', // 따뜻한 회갈색, 부드러운 인상
};
export const history = [
    {
        year: '2022-2024',
        side: 'left', // 왼쪽에 표시
        items: [
            '자기 찾기 연구소 설립',
            '자문위원 비대면 합동 워크숍 개최',
            '’map of the self‘ 프로젝트 시작',
            '세계 여행 팝업스토어in 강북',
            "초청강연 고전 명작 '클래식 클래스'in 고려대학교",
            '자문위원 대면 합동 워크숍 개최',
            '자기계발도서 ’안녕, 내 이름은 공두와 다념이‘ 출간',
            "알라딘 'Whole new world' 팝업스토어",
            '북토크 ‘독파민’ 개최',
            '능력개발교육 작가 워크숍 개최',
            "'1'데이-클래스 아로마테라피",
        ],
    },
    {
        year: '2025',
        side: 'right', // 오른쪽에 표시
        items: [
            '‘Once’ 팝업스토어in 공릉 아트스페이스',
            "'1'데이-클래스 퍼스널브랜딩",
            'Episode moment 팝업스토어',
            '당신을 위한 소중한 선물, SCOOP DAY 개최',
            "'쉼표 프로젝트' 운영진 워크숍 개최",
            'Episode moment 팝업스토어in 혜화',
            "자기계발도서 '먼지의 하루' 작가 모집",
            '초청 강사 워크숍 개최',
            "인생수업, 'INSIDE ME' 강연",
        ],
    },
];
